const arrayBigDataGames = [
	{
		_id: "loldota2fdgcvb",
		added: "Admin",
		idMiddleParent: "2dota2lol56",
		poster: "dota2QueenOfPain.jpg",
		posterAlt: "QueenOfPain - черная королева",
		linkPublisher: "https://www.dota2.com",
		messageForMenuActivity: `"Dota 2 — невообразимо интересная и глубокая командная игра. Вы можете наиграть две, три, четыре сотни часов, но все равно не знать всех подробностей". - ИГРОМАНИЯ`,
		releaseDate: "9 июля 2013",
		developer: { name: "Valve", linkResourceDeveloper: "https://www.valvesoftware.com" },
		publisher: { name: "Valve", linkResourcePublisher: "https://www.valvesoftware.com" },
		slidersHead: [
			{path: "dota1.jpg", alt: "Templar - персонаж из игры"},
			{path: "dota2.jpg", alt: "Puck - персонаж из игры"},
			{path: "dota3.jpg", alt: "Dazzle - персонаж из игры"},
			{path: "dota4.jpg", alt: "Necrophos - персонаж из игры"},
			{path: "dota5.jpg", alt: "Juggernaut - персонаж из игры"},
			{path: "dota6.jpg", alt: "Skeleton King - персонаж из игры"},
			{path: "dota7.jpg", alt: "Meepo - персонаж из игры"},
			{path: "dota8.jpg", alt: "Brewmaster - персонаж из игры"},
			{path: "dota9.jpg", alt: "Antimage - персонаж из игры"},
			{path: "dota10.jpg", alt: "OgreMag - персонаж с двумя головами из игры"},
			{path: "dota11.jpg", alt: "Ember Spirit - персонаж из игры"}
		],
		aboutTheGame: {
			title: "Готовься к самым эпичным битвам в твоей жизни.",
			text: "По мнению некоторых топовых изданий Dota 2 - это номер 1 среди многопользовательских игр. Ее онлайны впечатляют, а все конкуренты в этот момент курят в сторонке, и в то же время ее можно любить и ненавидеть одновременно. Dota2 - многопользовательская командная компьютерная игра в жанре MOBA, разработанная и изданная корпорацией Valve. Игра является продолжением DotA — пользовательской карты-модификации для игры Warcraft III: Reign of Chaos и дополнения к ней Warcraft III: The Frozen Throne. Игра изображает сражение на карте особого вида; в каждом матче участвуют две команды по пять игроков, управляющих «героями» — персонажами с различными наборами способностей. Для победы в матче команда должна уничтожить особый объект-«крепость», принадлежащий вражеской стороне, и защитить от уничтожения собственную «крепость». Dota 2 работает по модели free-to-play с элементами микроплатежей. Dota 2 является активной киберспортивной дисциплиной, в которой профессиональные команды со всего мира соревнуются в различных лигах и турнирах. Премиум-турниры по Dota 2 имеют призовые фонды в миллионы долларов, не раз становившиеся крупнейшими в истории киберспорта. Самый крупный турнир по игре — The International, ежегодно проводимый Valve. Начиная с сезона 2017/18 Valve также организует Dota Pro Circuit — профессиональный сезон, проводящийся в течение года. Крупные профессиональные турниры по Dota 2 транслируются на видеостриминговых сервисах, иногда набирая свыше миллиона зрителей одновременно. Людей, играющих в Dota 2, часто называют «дотерами» (/)*_*(/)."
		},
		atmosphere: {
			title: "Профессиональный взгляд на всеми любимую MOBA",
			blocks: [
				{
					path: "dota2Heroes.jpg",
					alt: "Все герои из игры Dota2",
					title: "Каталог героев",
					text: "Список героев ошеломляет даже самых искушенных механиками игроков. Тактики их использования разнообразны. Если вам нравится месить всех направо/налево возмите Axe, если предпочитаете притянуть /мерзавца/ и настучать ему по голове, возьмите Pudge. Нравится быть героем поддержки, возьмите загадочного Wisp и т.д. Способности персонажей разнообразны, поэтому вперед, опробуйте их всех!"
				},
				{
					path: "internationalDota2.jpg",
					alt: "Турнир The International dota 2. Арена",
					title: "Турниры и сообщество",
					text: "Следите за профессиональными игроками из dota 2. Учитесь у лучших, у них всегда есть, что посмотреть. Турниры проводятся практически постоянно. И самое главное - они приближают самое грандиозное событие из мира Dota 2 - The International."
				},
				{
					path: "dota1.jpg",
					alt: "Drow Ranger из дота 1",
					title: "Великая история",
					text: "У dota 2 великая история. Не многие современные игроки dota 2 знаю о dota 1. Достояние Айсфрога мы не забудем никогда) Существует большое количество вариаций DotA, но наиболее популярная из них — DotA Allstars, разрабатываемая IceFrog с 2005 года. В 2000-х годах DotA представляла собой востребованную киберспортивную дисциплину — начиная с первого турнира на BlizzCon в 2005 году, соревнования по ней проводились на таких чемпионатах, как азиатский World Cyber Games или Electronic Sports World Cup. В последующие годы разными компаниями было выпущено множество игр-подражаний, составивших самостоятельный жанр MOBA. В 2009 году американская компания Valve зарегистрировала слово «Dota» как собственный товарный знак и позже выпустила игру Dota 2."
				},
				{
					path: "mapDota2.jpg",
					alt: "Мини-карта доты 2",
					title: "Цель игры",
					text: "Цель игры — уничтожив башни противника хотя бы на одной тропинке (по 3 башни на каждой), прорваться на его базу и разрушить главное здание (Мировое древо у светлых, Ледяной трон у тёмных), предварительно уничтожив две башни, охраняющие его. Если будут уничтожены все башни на тропинке и находящиеся в лагере казармы, крипы нападающей стороны на этой тропинке становятся сильнее, а награда за их убийство становится примерно вдвое меньше. После разрушения всех казарм на трёх тропинках крипы превращаются в мегакрипов (англ. Mega Creeps), уничтожить которых значительно сложнее."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT, ATI/AMD Radeon HD2600/3600"},
				{title: "DirectX", value: "Версии 9.0c"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Совместимая с DirectX"}
			],
			Linux: [
				{title: "ОС", value: "Ubuntu 12.04 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT (драйвер версии 331), AMD HD 2xxx-4xxx (драйвер Mesa 10.5.9), AMD HD 5xxx+ (драйвер Mesa 10.5.9 или Catalyst 15.7), Intel HD 3000 (драйвер Mesa 10.6)"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Звуковая карта, совместимая с OpenAL"}
			],
			Apple: [
				{title: "ОС", value: "OS X Mavericks 10.9 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор от Intel"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA 320M или выше, Radeon HD 2400 или выше, Intel HD 3000 или выше"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"}
			]
		}
	},
	{
		_id: "maglol25464564",
		added: "Admin",
		idMiddleParent: "21spark567magica2dfg675",
		poster: "magicka2MagiPoster.jpg",
		posterAlt: "Маг-волшебник в красной мантии сражается",
		linkPublisher: "https://www.paradoxinteractive.com/games/magicka-2/about",
		messageForMenuActivity: `"Magicka — это уже почти культ, целая школа садистского кооперативного экшена про то, как смешно убивать своих друзей. А тут ее вторая часть, что может быть лучше?)" - ИГРОМАНИЯ`,
		releaseDate: "26 мая 2015",
		developer: { name: "Pieces Interactive", linkResourceDeveloper: "https://www.piecesinteractive.se/" },
		publisher: { name: "Paradox Interactive", linkResourcePublisher: "https://www.paradoxinteractive.com/our-games/discover" },
		slidersHead: [
			{path: "drakonMagi2.jpg", alt: "Маги штурмуют пещеру дракона с сокровищами"},
			{path: "magicka2MagAttak.jpg", alt: "Маг из Magicka 2 демонстрирует меч"},
			{path: "magickaVampir.jpg", alt: "Вампир управляет магами, как марионетками"},
			{path: "magickaFire.jpg", alt: "Маги идут по тропе с поля битвы, у одного из них загорелся плащ"}
		],
		aboutTheGame: {
			title: "Цвет помешательства.",
			text: "Magicka 2 ни капли не изменилась: волшебники, числом от одного до четырех, выкашивают десятки и сотни врагов, составляя заклинания из восьми базовых элементов. Слепили элемент земли с элементом огня — получили огненный шар. Склеили луч смерти с квантом воды — получили дальнобойный водомет. Объединили воду с электричеством — получили удар током, в полном соответствии с законами физики."
		},
		atmosphere: {
			title: "Волшебники и не вампиры",
			blocks: [
				{
					path: "magicka2War1.jpg",
					alt: "Маги сражаются с великанами",
					title: "Увлекательное рубилово",
					text: "Краши монстров во все стороны. Дай им звонково пенделя, чтобы улетел в открытый космос)"
				},
				{
					path: "magicka2War2.jpg",
					alt: "Маги сражаются с крабами на пляже",
					title: "Когда на пляже можно не только загорать",
					text: "Отойди в сторонку, пока твои напарники сдерживают полчаща крабов, накастую мега водяной шар прям из моря и охлади всех и вся"
				},
				{
					path: "magicka2War3.jpg",
					alt: "Маг поливает песок вокруг себя огнем, чтобы троли при подходе к нему горели",
					title: "Хаос, но им можно управлять!",
					text: "Никто — никто — не застрахован от идиотской гибели в духе «пальнул лучом смерти, попал в пущенный напарником луч жизни, получилась черная дыра, ой» или «телепортировался от врага, угодил под выстрел союзника, черт побери»."
				},
				{
					path: "magicka2War4.jpg",
					alt: "Битва с крабами",
					title: "Карты на любой вкус",
					text: "От засушливых пустынь до непроходимых лесных болот, от солнечных пляжей, до суровых снежных лесов - все это разнообразие карт Magicka 2"
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7, 8 or 10"},
				{title: "Процессор", value: "CPU: 3GHz Dual Core (Intel Pentium G3220 or higher / AMD A4-4000 or higher)"},
				{title: "Оперативная память", value: "2 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GeForce 550 or better / ATI Radeon HD 5850 or better"},
				{title: "Место на диске", value: "3 GB"},
				{title: "Звуковая карта", value: "DirectX Compatible Sound Card"}
			],
			Linux: [
				{title: "ОС", value: "Ubuntu 12.04"},
				{title: "Процессор", value: "3GHz Dual Core (Intel Pentium G3220 or higher / AMD A4-4000 or higher)"},
				{title: "Оперативная память", value: "2 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GeForce 550 or better / ATI Radeon HD 5850 or better"},
				{title: "Место на диске", value: "3 GB"}
			],
			Apple: [
				{title: "ОС", value: "OSX 10.7"},
				{title: "Процессор", value: "Intel Core i5, 1.7GHz Dual-Core"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "Intel HD Graphics 4000"},
				{title: "Место на диске", value: "3 GB"}
			]
		}
	},
	{
		_id: "eldenRingRing123210678",
		added: "Admin",
		idMiddleParent: "1eldenRingMiddle77",
		poster: "eldenRingPoster.jpg",
		posterAlt: "Воин из EldenRing с мечом на плече показывает палец вверх",
		linkPublisher: "https://beta.bandainamcoent.eu/en/cb/elden-ring-beta",
		messageForMenuActivity: `"Осторожно, после прохождения возможна апатия к другим играм." - пользователь iXBT.games`,
		releaseDate: "25 февраля 2022",
		developer: { name: "From Software", linkResourceDeveloper: "https://www.fromsoftware.jp/ww/" },
		publisher: { name: "From Software", linkResourcePublisher: "https://www.fromsoftware.jp/ww/" },
		slidersHead: [
			{path: "eldenRingblock1.jpg", alt: "Чудовище из своей пасти выбрасывает в небо столб пламени"},
			{path: "eldenRingWar1.jpg", alt: "Два рыцаря сражаются на верхом на лошадях"},
			{path: "eldenRingNightSky.jpg", alt: "Рыцарь сидит у костра с путником ночью"},
			{path: "eldenRingWar2.jpg", alt: "Воин склонил колено из EldenRing"},
			{path: "eldenRingBoginy.jpg", alt: "Богиня"},
			{path: "maleniaEr.jpg", alt: "Девушка рыцарь на коне"}
		],
		aboutTheGame: {
			title: "Красота и интрига, но и боль прохождения",
			text: "Elden Ring — компьютерная игра в жанре action/RPG с открытым миром, разработанная японской компанией FromSoftware и изданная компанией Bandai Namco Entertainment. Elden Ring неожиданно хорошо поддерживает интригу на протяжении многих часов. Она постоянно дарит радость открытий, ставшую визитной карточкой предыдущих проектов студии, только теперь FromSoftware каким-то образом смогла воссоздать неповторимую магию Dark Souls в совершенно непостижимых масштабах. Мир Elden Ring гораздо больше, чем можно представить: слитые в Сеть изображения карты едва ли передают истинный размах игры."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "eldenRingPodzemelie.jpg",
					alt: "Воин держит факел в руке",
					title: "Исследуй самые потаенные уголки карт",
					text: "Великий и ужасный Хидэтака Миядзаки оставил для тебя различные тайные комнаты и проходы, нел енись изучать карты, любопытство дарует воину сокровища!"
				},
				{
					path: "eldenRingVorota.jpeg",
					alt: "Воин стоит перед огромными железными варотами",
					title: "Закрыто =/ значит всегда можно найти тайный лаз",
					text: "Карты предоставляют вариативность действий на них. Ты можешь тайком забраться на часовню и потом спрыгнуть вниз и рубануть как следует врагов своей секирой."
				},
				{
					path: "eldenringtroll.jpg",
					alt: "Ужасная тварь в пещере перед главным героем",
					title: "Боссы порой заставляют тебя заплакать от ужаса)",
					text: "Да, монстров очень много, чертовски много. И что самое главное, все они разные, кто-то большой, кто-то маленький. Есть воины на конях, а есть пешие. Для всех них существуют свои атаки и тактики, которые тебе приходится понимать по ходу боя."
				},
				{
					path: "eldenRingThunk.jpeg",
					alt: "Главный герой поражает монстра добивающим ударом",
					title: "Добивающий удар (его урон) зависет от прокачки оружия",
					text: "Не ленись собирать души и раскачивать оружие и броню, мощь твоих доспехов и клинка принесет тебе победу."
				},
				{
					path: "eldenRingMonstrWarWar.jpg",
					alt: "Главный герой увернулся от монстра, который проводит мощную атаку",
					title: "Всегда будь начеку",
					text: "Враги могут выполнять смертоносные атаки, постарайся не подставляться под них. Твои доспехи конечно крепкие, но порой они не выдерживают."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 10"},
				{title: "Процессор", value: "INTEL CORE I5-8400 or AMD RYZEN 3 3300X"},
				{title: "Оперативная память", value: "12 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GEFORCE GTX 1060 3 GB or AMD RADEON RX 580 4 GB"},
				{title: "Место на диске", value: "60 GB"},
				{title: "Звуковая карта", value: "Windows Compatible Audio Device"},
				{title: "DirectX", value: "Версия 12"}
			]
		}
	}
]

function getBigDataGameById(id) {
	return new Promise((resolve, reject) => {
		const findEl = arrayBigDataGames.find(item => item.idMiddleParent === id)
		setTimeout(() => {
			resolve(findEl)
		}, 1000)
	})
}

export default getBigDataGameById
