const arrayBigDataGames = [
	{
		_id: "loldota2fdgcvb",
		added: "Admin",
		idMiddleParent: "2dota2lol56",
		poster: "dota2QueenOfPain.jpg",
		slidersHead: [
			{path: "dota1.jpg", alt: "Templar - персонаж из игры"},
			{path: "dota2.jpg", alt: "Void - персонаж из игры"},
			{path: "dota3.jpg", alt: "Dazzle - персонаж из игры"},
			{path: "dota4.jpg", alt: "Necrophos - персонаж из игры"},
			{path: "dota5.jpg", alt: "Juggernaut - персонаж из игры"},
			{path: "dota6.jpg", alt: "Skeleton King - персонаж из игры"},
			{path: "dota7.jpg", alt: "Meepo - персонаж из игры"},
		],
		aboutTheGame: "По мнению некоторых топовых изданий Dota 2 - это номер 1 среди многопользовательских игр. Ее онлайны впечатляют, а все конкуренты в этот момент курят в сторонке, и в то же время ее можно любить и ненавидеть одновременно. Dota2 - многопользовательская командная компьютерная игра в жанре MOBA, разработанная и изданная корпорацией Valve. Игра является продолжением DotA — пользовательской карты-модификации для игры Warcraft III: Reign of Chaos и дополнения к ней Warcraft III: The Frozen Throne. Игра изображает сражение на карте особого вида; в каждом матче участвуют две команды по пять игроков, управляющих «героями» — персонажами с различными наборами способностей. Для победы в матче команда должна уничтожить особый объект-«крепость», принадлежащий вражеской стороне, и защитить от уничтожения собственную «крепость». Dota 2 работает по модели free-to-play с элементами микроплатежей. Dota 2 является активной киберспортивной дисциплиной, в которой профессиональные команды со всего мира соревнуются в различных лигах и турнирах. Премиум-турниры по Dota 2 имеют призовые фонды в миллионы долларов, не раз становившиеся крупнейшими в истории киберспорта. Самый крупный турнир по игре — The International, ежегодно проводимый Valve. Начиная с сезона 2017/18 Valve также организует Dota Pro Circuit — профессиональный сезон, проводящийся в течение года. Крупные профессиональные турниры по Dota 2 транслируются на видеостриминговых сервисах, иногда набирая свыше миллиона зрителей одновременно. Людей, играющих в Dota 2, часто называют «дотерами» (\/)*_*(\/).",
		atmosphere: {
			title: "Профессиональный взгляд на всеми любимую MOBA",
			blocks: [
				{
					path: "dota2Heroes.jpg",
					alt: "Все герои из игры Dota2",
					title: "Каталог героев",
					text: "Список героев ошеломляет даже самых искушенных механиками игроков. Тактики их использования разнообразны. Если вам нравится месить всех направо/налево возмите Axe, если предпочитаете притянуть /мерзавца/ и настучать ему по голове, возьмите Pudge. Нравится быть героем поддержки, возьмите загадочного Wisp и т.д. Способности персонажей разнообразны, поэтому вперед, опробуйте их всех!"
				},
				{
					path: "internationalDota2.jpg",
					alt: "Турнир The International dota 2. Арена",
					title: "Турниры и сообщество",
					text: "Следите за профессиональными игроками из dota 2. Учитесь у лучших, у них всегда есть, что посмотреть. Турниры проводятся практически постоянно. И самое главное - они приближают самое грандиозное событие из мира Dota 2 - The International."
				},
				{
					path: "dota1.jpg",
					alt: "Drow Ranger из дота 1",
					title: "Великая история",
					text: "У dota 2 великая история. Не многие современные игроки dota 2 знаю о dota 1. Достояние Айсфрога мы не забудем никогда) Существует большое количество вариаций DotA, но наиболее популярная из них — DotA Allstars, разрабатываемая IceFrog с 2005 года. В 2000-х годах DotA представляла собой востребованную киберспортивную дисциплину — начиная с первого турнира на BlizzCon в 2005 году, соревнования по ней проводились на таких чемпионатах, как азиатский World Cyber Games или Electronic Sports World Cup. В последующие годы разными компаниями было выпущено множество игр-подражаний, составивших самостоятельный жанр MOBA. В 2009 году американская компания Valve зарегистрировала слово «Dota» как собственный товарный знак и позже выпустила игру Dota 2."
				},
				{
					path: "mapDota2.jpg",
					alt: "Мини-карта доты 2",
					title: "Цель игры",
					text: "Цель игры — уничтожив башни противника хотя бы на одной тропинке (по 3 башни на каждой), прорваться на его базу и разрушить главное здание (Мировое древо у светлых, Ледяной трон у тёмных), предварительно уничтожив две башни, охраняющие его. Если будут уничтожены все башни на тропинке и находящиеся в лагере казармы, крипы нападающей стороны на этой тропинке становятся сильнее, а награда за их убийство становится примерно вдвое меньше. После разрушения всех казарм на трёх тропинках крипы превращаются в мегакрипов (англ. Mega Creeps), уничтожить которых значительно сложнее."
				}
			]
		},
		systemRequirements: {
			windows: [
				{title: "OC", value: "Windows 7 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT, ATI/AMD Radeon HD2600/3600"},
				{title: "DirectX", value: "Версии 9.0c"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Совместимая с DirectX"}
			],
			linux: [
				{title: "ОС", value: "Ubuntu 12.04 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT (драйвер версии 331), AMD HD 2xxx-4xxx (драйвер Mesa 10.5.9), AMD HD 5xxx+ (драйвер Mesa 10.5.9 или Catalyst 15.7), Intel HD 3000 (драйвер Mesa 10.6)"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Звуковая карта, совместимая с OpenAL"}
			],
			macOS: [
				{title: "ОС", value: "OS X Mavericks 10.9 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор от Intel"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA 320M или выше, Radeon HD 2400 или выше, Intel HD 3000 или выше"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"}
			]
		}
	}
]

function getBigDataGameById(id) {
	return new Promise((resolve, reject) => {
		const findEl = arrayBigDataGames.find(item => item.idMiddleParent === id)
		setTimeout(() => {
			resolve(findEl)
		}, 1000)
	})
}

export default getBigDataGameById
