const arrayBigDataGames = [
	{
		_id: "loldota2fdgcvb",
		added: "Admin",
		idMiddleParent: "2dota2lol56",
		poster: "dota2QueenOfPain.jpg",
		posterAlt: "QueenOfPain - черная королева",
		linkPublisher: "https://www.dota2.com",
		messageForMenuActivity: `"Dota 2 — невообразимо интересная и глубокая командная игра. Вы можете наиграть две, три, четыре сотни часов, но все равно не знать всех подробностей". - ИГРОМАНИЯ`,
		releaseDate: "09 июля 2013",
		developer: { name: "Valve", linkResourceDeveloper: "https://www.valvesoftware.com" },
		publisher: { name: "Valve", linkResourcePublisher: "https://www.valvesoftware.com" },
		slidersHead: [
			{path: "dota1.jpg", alt: "Templar - персонаж из игры"},
			{path: "dota2.jpg", alt: "Puck - персонаж из игры"},
			{path: "dota3.jpg", alt: "Dazzle - персонаж из игры"},
			{path: "dota4.jpg", alt: "Necrophos - персонаж из игры"},
			{path: "dota5.jpg", alt: "Juggernaut - персонаж из игры"},
			{path: "dota6.jpg", alt: "Skeleton King - персонаж из игры"},
			{path: "dota7.jpg", alt: "Meepo - персонаж из игры"},
			{path: "dota8.jpg", alt: "Brewmaster - персонаж из игры"},
			{path: "dota9.jpg", alt: "Antimage - персонаж из игры"},
			{path: "dota10.jpg", alt: "OgreMag - персонаж с двумя головами из игры"},
			{path: "dota11.jpg", alt: "Ember Spirit - персонаж из игры"}
		],
		aboutTheGame: {
			title: "Готовься к самым эпичным битвам в твоей жизни.",
			text: "По мнению некоторых топовых изданий Dota 2 - это номер 1 среди многопользовательских игр. Ее онлайны впечатляют, а все конкуренты в этот момент курят в сторонке, и в то же время ее можно любить и ненавидеть одновременно. Dota2 - многопользовательская командная компьютерная игра в жанре MOBA, разработанная и изданная корпорацией Valve. Игра является продолжением DotA — пользовательской карты-модификации для игры Warcraft III: Reign of Chaos и дополнения к ней Warcraft III: The Frozen Throne. Игра изображает сражение на карте особого вида; в каждом матче участвуют две команды по пять игроков, управляющих «героями» — персонажами с различными наборами способностей. Для победы в матче команда должна уничтожить особый объект-«крепость», принадлежащий вражеской стороне, и защитить от уничтожения собственную «крепость». Dota 2 работает по модели free-to-play с элементами микроплатежей. Dota 2 является активной киберспортивной дисциплиной, в которой профессиональные команды со всего мира соревнуются в различных лигах и турнирах. Премиум-турниры по Dota 2 имеют призовые фонды в миллионы долларов, не раз становившиеся крупнейшими в истории киберспорта. Самый крупный турнир по игре — The International, ежегодно проводимый Valve. Начиная с сезона 2017/18 Valve также организует Dota Pro Circuit — профессиональный сезон, проводящийся в течение года. Крупные профессиональные турниры по Dota 2 транслируются на видеостриминговых сервисах, иногда набирая свыше миллиона зрителей одновременно. Людей, играющих в Dota 2, часто называют «дотерами» (/)*_*(/)."
		},
		atmosphere: {
			title: "Профессиональный взгляд на всеми любимую MOBA",
			blocks: [
				{
					path: "dota2Heroes.jpg",
					alt: "Все герои из игры Dota2",
					title: "Каталог героев",
					text: "Список героев ошеломляет даже самых искушенных механиками игроков. Тактики их использования разнообразны. Если вам нравится месить всех направо/налево возмите Axe, если предпочитаете притянуть /мерзавца/ и настучать ему по голове, возьмите Pudge. Нравится быть героем поддержки, возьмите загадочного Wisp и т.д. Способности персонажей разнообразны, поэтому вперед, опробуйте их всех!"
				},
				{
					path: "internationalDota2.jpg",
					alt: "Турнир The International dota 2. Арена",
					title: "Турниры и сообщество",
					text: "Следите за профессиональными игроками из dota 2. Учитесь у лучших, у них всегда есть, что посмотреть. Турниры проводятся практически постоянно. И самое главное - они приближают самое грандиозное событие из мира Dota 2 - The International."
				},
				{
					path: "dota1.jpg",
					alt: "Drow Ranger из дота 1",
					title: "Великая история",
					text: "У dota 2 великая история. Не многие современные игроки dota 2 знаю о dota 1. Достояние Айсфрога мы не забудем никогда) Существует большое количество вариаций DotA, но наиболее популярная из них — DotA Allstars, разрабатываемая IceFrog с 2005 года. В 2000-х годах DotA представляла собой востребованную киберспортивную дисциплину — начиная с первого турнира на BlizzCon в 2005 году, соревнования по ней проводились на таких чемпионатах, как азиатский World Cyber Games или Electronic Sports World Cup. В последующие годы разными компаниями было выпущено множество игр-подражаний, составивших самостоятельный жанр MOBA. В 2009 году американская компания Valve зарегистрировала слово «Dota» как собственный товарный знак и позже выпустила игру Dota 2."
				},
				{
					path: "mapDota2.jpg",
					alt: "Мини-карта доты 2",
					title: "Цель игры",
					text: "Цель игры — уничтожив башни противника хотя бы на одной тропинке (по 3 башни на каждой), прорваться на его базу и разрушить главное здание (Мировое древо у светлых, Ледяной трон у тёмных), предварительно уничтожив две башни, охраняющие его. Если будут уничтожены все башни на тропинке и находящиеся в лагере казармы, крипы нападающей стороны на этой тропинке становятся сильнее, а награда за их убийство становится примерно вдвое меньше. После разрушения всех казарм на трёх тропинках крипы превращаются в мегакрипов (англ. Mega Creeps), уничтожить которых значительно сложнее."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT, ATI/AMD Radeon HD2600/3600"},
				{title: "DirectX", value: "Версии 9.0c"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Совместимая с DirectX"}
			],
			Linux: [
				{title: "ОС", value: "Ubuntu 12.04 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор с тактовой частотой 2,80 ГГц от Intel или AMD"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce 8600/9600GT (драйвер версии 331), AMD HD 2xxx-4xxx (драйвер Mesa 10.5.9), AMD HD 5xxx+ (драйвер Mesa 10.5.9 или Catalyst 15.7), Intel HD 3000 (драйвер Mesa 10.6)"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"},
				{title: "Звуковая карта", value: "Звуковая карта, совместимая с OpenAL"}
			],
			Apple: [
				{title: "ОС", value: "OS X Mavericks 10.9 или новее"},
				{title: "Процессор", value: "Двухъядерный процессор от Intel"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA 320M или выше, Radeon HD 2400 или выше, Intel HD 3000 или выше"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "15 GB"}
			]
		}
	},
	{
		_id: "maglol25464564",
		added: "Admin",
		idMiddleParent: "21spark567magica2dfg675",
		poster: "magicka2MagiPoster.jpg",
		posterAlt: "Маг-волшебник в красной мантии сражается",
		linkPublisher: "https://www.paradoxinteractive.com/games/magicka-2/about",
		messageForMenuActivity: `"Magicka — это уже почти культ, целая школа садистского кооперативного экшена про то, как смешно убивать своих друзей. А тут ее вторая часть, что может быть лучше?)" - ИГРОМАНИЯ`,
		releaseDate: "26 мая 2015",
		developer: { name: "Pieces Interactive", linkResourceDeveloper: "https://www.piecesinteractive.se/" },
		publisher: { name: "Paradox Interactive", linkResourcePublisher: "https://www.paradoxinteractive.com/our-games/discover" },
		slidersHead: [
			{path: "drakonMagi2.jpg", alt: "Маги штурмуют пещеру дракона с сокровищами"},
			{path: "magicka2MagAttak.jpg", alt: "Маг из Magicka 2 демонстрирует меч"},
			{path: "magickaVampir.jpg", alt: "Вампир управляет магами, как марионетками"},
			{path: "magickaFire.jpg", alt: "Маги идут по тропе с поля битвы, у одного из них загорелся плащ"}
		],
		aboutTheGame: {
			title: "Цвет помешательства.",
			text: "Magicka 2 ни капли не изменилась: волшебники, числом от одного до четырех, выкашивают десятки и сотни врагов, составляя заклинания из восьми базовых элементов. Слепили элемент земли с элементом огня — получили огненный шар. Склеили луч смерти с квантом воды — получили дальнобойный водомет. Объединили воду с электричеством — получили удар током, в полном соответствии с законами физики."
		},
		atmosphere: {
			title: "Волшебники и не вампиры",
			blocks: [
				{
					path: "magicka2War1.jpg",
					alt: "Маги сражаются с великанами",
					title: "Увлекательное рубилово",
					text: "Краши монстров во все стороны. Дай им звонково пенделя, чтобы улетел в открытый космос)"
				},
				{
					path: "magicka2War2.jpg",
					alt: "Маги сражаются с крабами на пляже",
					title: "Когда на пляже можно не только загорать",
					text: "Отойди в сторонку, пока твои напарники сдерживают полчаща крабов, накастую мега водяной шар прям из моря и охлади всех и вся"
				},
				{
					path: "magicka2War3.jpg",
					alt: "Маг поливает песок вокруг себя огнем, чтобы троли при подходе к нему горели",
					title: "Хаос, но им можно управлять!",
					text: "Никто — никто — не застрахован от идиотской гибели в духе «пальнул лучом смерти, попал в пущенный напарником луч жизни, получилась черная дыра, ой» или «телепортировался от врага, угодил под выстрел союзника, черт побери»."
				},
				{
					path: "magicka2War4.jpg",
					alt: "Битва с крабами",
					title: "Карты на любой вкус",
					text: "От засушливых пустынь до непроходимых лесных болот, от солнечных пляжей, до суровых снежных лесов - все это разнообразие карт Magicka 2"
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7, 8 or 10"},
				{title: "Процессор", value: "CPU: 3GHz Dual Core (Intel Pentium G3220 or higher / AMD A4-4000 or higher)"},
				{title: "Оперативная память", value: "2 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GeForce 550 or better / ATI Radeon HD 5850 or better"},
				{title: "Место на диске", value: "3 GB"},
				{title: "Звуковая карта", value: "DirectX Compatible Sound Card"}
			],
			Linux: [
				{title: "ОС", value: "Ubuntu 12.04"},
				{title: "Процессор", value: "3GHz Dual Core (Intel Pentium G3220 or higher / AMD A4-4000 or higher)"},
				{title: "Оперативная память", value: "2 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GeForce 550 or better / ATI Radeon HD 5850 or better"},
				{title: "Место на диске", value: "3 GB"}
			],
			Apple: [
				{title: "ОС", value: "OSX 10.7"},
				{title: "Процессор", value: "Intel Core i5, 1.7GHz Dual-Core"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "Intel HD Graphics 4000"},
				{title: "Место на диске", value: "3 GB"}
			]
		}
	},
	{
		_id: "eldenRingRing123210678",
		added: "Admin",
		idMiddleParent: "1eldenRingMiddle77",
		poster: "eldenRingPoster.jpg",
		posterAlt: "Воин из EldenRing с мечом на плече показывает палец вверх",
		linkPublisher: "https://beta.bandainamcoent.eu/en/cb/elden-ring-beta",
		messageForMenuActivity: `"Осторожно, после прохождения возможна апатия к другим играм." - пользователь iXBT.games`,
		releaseDate: "25 февраля 2022",
		developer: { name: "From Software", linkResourceDeveloper: "https://www.fromsoftware.jp/ww/" },
		publisher: { name: "From Software", linkResourcePublisher: "https://www.fromsoftware.jp/ww/" },
		slidersHead: [
			{path: "eldenRingblock1.jpg", alt: "Чудовище из своей пасти выбрасывает в небо столб пламени"},
			{path: "eldenRingWar1.jpg", alt: "Два рыцаря сражаются на верхом на лошадях"},
			{path: "eldenRingNightSky.jpg", alt: "Рыцарь сидит у костра с путником ночью"},
			{path: "eldenRingWar2.jpg", alt: "Воин склонил колено из EldenRing"},
			{path: "eldenRingBoginy.jpg", alt: "Богиня"},
			{path: "maleniaEr.jpg", alt: "Девушка рыцарь на коне"}
		],
		aboutTheGame: {
			title: "Красота и интрига, но и боль прохождения",
			text: "Elden Ring — компьютерная игра в жанре action/RPG с открытым миром, разработанная японской компанией FromSoftware и изданная компанией Bandai Namco Entertainment. Elden Ring неожиданно хорошо поддерживает интригу на протяжении многих часов. Она постоянно дарит радость открытий, ставшую визитной карточкой предыдущих проектов студии, только теперь FromSoftware каким-то образом смогла воссоздать неповторимую магию Dark Souls в совершенно непостижимых масштабах. Мир Elden Ring гораздо больше, чем можно представить: слитые в Сеть изображения карты едва ли передают истинный размах игры."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "eldenRingPodzemelie.jpg",
					alt: "Воин держит факел в руке",
					title: "Исследуй самые потаенные уголки карт",
					text: "Великий и ужасный Хидэтака Миядзаки оставил для тебя различные тайные комнаты и проходы, нел енись изучать карты, любопытство дарует воину сокровища!"
				},
				{
					path: "eldenRingVorota.jpeg",
					alt: "Воин стоит перед огромными железными варотами",
					title: "Закрыто =/ значит всегда можно найти тайный лаз",
					text: "Карты предоставляют вариативность действий на них. Ты можешь тайком забраться на часовню и потом спрыгнуть вниз и рубануть как следует врагов своей секирой."
				},
				{
					path: "eldenringtroll.jpg",
					alt: "Ужасная тварь в пещере перед главным героем",
					title: "Боссы порой заставляют тебя заплакать от ужаса)",
					text: "Да, монстров очень много, чертовски много. И что самое главное, все они разные, кто-то большой, кто-то маленький. Есть воины на конях, а есть пешие. Для всех них существуют свои атаки и тактики, которые тебе приходится понимать по ходу боя."
				},
				{
					path: "eldenRingThunk.jpeg",
					alt: "Главный герой поражает монстра добивающим ударом",
					title: "Добивающий удар (его урон) зависет от прокачки оружия",
					text: "Не ленись собирать души и раскачивать оружие и броню, мощь твоих доспехов и клинка принесет тебе победу."
				},
				{
					path: "eldenRingMonstrWarWar.jpg",
					alt: "Главный герой увернулся от монстра, который проводит мощную атаку",
					title: "Всегда будь начеку",
					text: "Враги могут выполнять смертоносные атаки, постарайся не подставляться под них. Твои доспехи конечно крепкие, но порой они не выдерживают."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 10"},
				{title: "Процессор", value: "INTEL CORE I5-8400 or AMD RYZEN 3 3300X"},
				{title: "Оперативная память", value: "12 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GEFORCE GTX 1060 3 GB or AMD RADEON RX 580 4 GB"},
				{title: "Место на диске", value: "60 GB"},
				{title: "Звуковая карта", value: "Windows Compatible Audio Device"},
				{title: "DirectX", value: "Версия 12"}
			]
		}
	},
	{
		_id: "gamedec8789340534databig",
		added: "Admin",
		idMiddleParent: "21spark567gamedec",
		poster: "gamedecPoster.jpg",
		posterAlt: "Девушка из мира Gamedec на фоне города",
		linkPublisher: "https://gamedec.com/",
		messageForMenuActivity: `"Интригующий сюжет; проработанный сеттинг, сочетающий типичный киберпанк с актуальной сатирой и пародией на современные игры; необычный игровой процесс на стыке детектива, квеста и RPG; моральный выбор и множество вариантов решения задач; великолепные графика, музыка и работа со звуком." - Кирилл Волошин о Gamedec`,
		releaseDate: "16 сентября 2021",
		developer: { name: "Anshar Studios", linkResourceDeveloper: "https://ansharstudios.com/" },
		publisher: { name: "Anshar Publishing", linkResourcePublisher: "https://ansharstudios.com/anshar-publishing/" },
		slidersHead: [
			{path: "gamedec1.webp", alt: "Персонаж из игры IZMAEL KROSTOV"},
			{path: "gamedec2.jpg", alt: "Момент из игры, персонаж девушка находится в помещении"},
			{path: "gamedec3.jpg", alt: "Взрыв у металлического забора на улице"},
			{path: "gamedec4.jpg", alt: "Дерево из игры"},
			{path: "gamedec5.jpg", alt: "Преступление"},
			{path: "gamedec6.jpg", alt: "Персонаж из игры"}
		],
		aboutTheGame: {
			title: "Я в геймдеки пойду, пусть меня научат",
			text: "Gamedec — это разговорная RPG (в этом смысле она и правда в духе Disco Elysium), действие которой разворачивается в футуристической Новой Варшаве победившего киберпанка и VR-технологий. Последние настолько победили, что чуть ли не львиная доля населения большую часть времени проводит в виртуальных мирах и играх («виртуалиум» на местном жаргоне), пользуясь для этого специальным оборудованием (креслами и шлемами, прежде всего), игротаблетками и прочими стимуляторами для придания реальной остроты ощущениям в нереальных пространствах."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "gamedecPost1.jpg",
					alt: "Ветка прокачки персонажа",
					title: "Вроде ничего нового, но прикольно",
					text: "Ветки с навыками и умениями прокачки - это не что-то новое, но как всегда чертовски интересно"
				},
				{
					path: "gamedec2.jpg",
					alt: "Персонажи из игры стоят на платформе",
					title: "Увлекательный мир",
					text: "Вселенная Gamedec очень увлекательная и красочная. Неон и технологии - это то самое сочетание, которым всегда притягивал Киберпанк"
				},
				{
					path: "gamedec3.jpg",
					alt: "Демонстрация общения с другими персонажами из игры",
					title: "Вариативность общения",
					text: "Общение с другими первсонажами - это что-то, очень захватывающе и увлекательно. Расследование каких-либо событий заставляет тебя трепещать от счастья."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 10 64-bit"},
				{title: "Процессор", value: "Intel i5-3570 / AMD FX-8140"},
				{title: "Оперативная память", value: "8 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GTX 760 / AMD Radeon R9 270"},
				{title: "Место на диске", value: "17 GB"},
				{title: "DirectX", value: "Версия 11"}
			]
		}
	},
	{
		_id: "atomicHeartBigData",
		added: "Admin",
		idMiddleParent: "3atomicHeart564",
		poster: "atomicHeartPoster.jpg",
		posterAlt: "Главный герой за рулем автомобиля пытается скрыться от робота",
		linkPublisher: "https://mundfish.com/ru/",
		messageForMenuActivity: `"BioShock по-советски: московская студия Mundfish выпустила трейлер Atomic Heart" - ИГРОМАНИЯ`,
		releaseDate: "__ __ 2022",
		developer: { name: "Mundfish", linkResourceDeveloper: "https://mundfish.com/ru/about-us/" },
		publisher: { name: "Mundfish", linkResourcePublisher: "https://mundfish.com/ru/about-us/" },
		slidersHead: [
			{path: "atomicHeartPost1.jpg", alt: "Главный герой сражается с Советским роботом"},
			{path: "atomicHeartPost2.jpg", alt: "Сражение с роботами в поле"},
			{path: "atomicHeartPost3.jpg", alt: "Лужайка Советского завода"},
			{path: "atomicHeart4Poster.jpg", alt: "Главный герой с дубиной на плече на красном фоне"}
		],
		aboutTheGame: {
			title: "СССР каким бы мы его не хотели увидеть",
			text: "На советском Предприятии №3826 происходит глобальный технический сбой - мирные машины уничтожают сотрудников. Вы - майор П-3. Вы должны устранить последствия масштабной аварии и предотвратить утечку секретной информации угрожающей уничтожить весь мир."
		},
		atmosphere: {
			title: "Атмосфера загадки опытов вышедших из-под контроля",
			blocks: [
				{
					path: "atomicHeartBlock1.jpg",
					alt: "Макет-аквариум на заводе из игры AtomicHeart",
					title: "Размах игры впечатляет",
					text: "Все эти декорации - это что-то с чем-то, просто чертовски увлекательная игра. Она еще даже не вышла, но все ее уже хотят купить."
				},
				{
					path: "atomicHeartBlock2.jpg",
					alt: "Главный герой сражается с летающими роботами",
					title: "Когда на улице слишком горячо",
					text: "Механики роботов многоообразны. Они прыгают, крутятся, взрываются, летают, скачут как попрыгунчики, детонируют, бьют, стреляют. Будь готов, что даже какой-то обычный провод сможет нанести тебе вред."
				},
				{
					path: "atomicHeartBlock3.jpg",
					alt: "Макет симбиоза игрушки с какой-то сущностью",
					title: "Загадка окутанная мраком",
					text: "Тебе предстоит не только устранять последствия опытов на заводе, но и разгадывать тайны."
				},
				{
					path: "atomicHeartBlock4.jpg",
					alt: "Ученые роботы",
					title: "Роботы выглядят как люди, а может они и есть люди?",
					text: "Да, потрясающий сюжет игры - это то, что Вам придется испытать."
				},
				{
					path: "atomicHeart5block.png",
					alt: "Команда разработчиков AtomicHeart дурачится с макетами оружия",
					title: "Создаем новое, а не копируем",
					text: "Мы не копируем — мы создаем новое. Первичность идей — основа нашей философии. Это и есть наша ДНК — создание первичного контента, который сам становится референсом."
				},
				{
					path: "atomicHeartBlock6.png",
					alt: "Команда разработчиков AtomicHeart на совещании",
					title: "Качество залог успеха",
					text: "Опытная команда разработчиков, для которой качество — абсолютный приоритет, позволила нам еще сильнее нарастить темпы. Для нас важно иметь полный контроль над созданием игры, и не отдавать его большим корпорациям, цели которых могут сильно отличаться от наших. Поэтому мы работаем только с теми компаниями, которые разделяют наш подход к разработке. Наши инвесторы — Gaijin Entertainment, Gem Capital и Tencent. Наш Hardware партнер — Nvidia."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "WINDOWS® 8, 8.1, 10 (64-BIT Required)"}
			]
		}
	},
	{
		_id: "theDayBigDataBefore546546",
		added: "Admin",
		idMiddleParent: "4theDayBefore9567",
		poster: "theDayBeforePoster.jpg",
		posterAlt: "Главный герой бродит по улицам вымершего города",
		linkPublisher: "https://www.daybeforegame.com/",
		messageForMenuActivity: `"Интересный амбициозный проект российских разработчиков. Снова удивили мир)". - Factory.inc`,
		releaseDate: "01 март 2023",
		developer: { name: "FNTASTIC", linkResourceDeveloper: "https://www.fntastic.com/" },
		publisher: { name: "MYTONA", linkResourcePublisher: "https://mytona.com/" },
		slidersHead: [
			{path: "tdbPoster1.jpg", alt: "Герой у заброшенного города"},
			{path: "tdbPoster2.jpeg", alt: "Упавший пассажирский самолет"},
			{path: "tbdPoster3.jpg", alt: "Переправа по реке на машинах"},
			{path: "tbdPoster4.png", alt: "Главный герой в торговом центре"},
			{path: "tbd5Poster.jpg", alt: "Перестрелка в магазине"}
		],
		aboutTheGame: {
			title: "Об игре The Day Before",
			text: "The Day Before — масштабный MMO-шутер с элементами выживания , действие которого происходит в «постпандемическом» мире. Вам предстоит стать одним из выживальщиков на территории Америки, наводненной голодными зомби и безжалостными бандитами. Путешествуя по стране, вы будете обыскивать дома и небоскребы в поисках ресурсов и взаимодействовать с другими людьми. Также можно будет посетить лагерь выживших, который служит хаб-локацией."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "tbdBlock1.jpg",
					alt: "Главный герой бродит по заброшенным улицам",
					title: "Красивая игра",
					text: "Декорации The Day Before впечатляют"
				},
				{
					path: "tdbpos2.jpg",
					alt: "Костер в лесу",
					title: "Нагнетающая атмосфера ужаса",
					text: "Никогда не понятно, где притаился зомби"
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "64-bit Windows 7, Windows 8.1, Windows 10"},
				{title: "Процессор", value: "Intel Core i5-4430 / AMD FX-6300"},
				{title: "Оперативная память", value: "10 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce GTX 960 2GB / AMD Radeon R7 370 2GB"},
				{title: "DirectX", value: "Версии 11"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "75 GB"}
			]
		}
	},
	{
		_id: "enlistedBigData",
		added: "Admin",
		idMiddleParent: "5enlisted8776",
		poster: "enlistedPoster.jpg",
		posterAlt: "Советские солдаты пробираются по рельефу",
		linkPublisher: "https://enlisted.net/ru/#!/",
		messageForMenuActivity: `"Казуальный хардкор". - MMO13`,
		releaseDate: "2 марта 2021",
		developer: { name: "Darkflow Software", linkResourceDeveloper: "https://darkflowsoftware.com/" },
		publisher: { name: "Gaijin Entertainment", linkResourcePublisher: "https://gaijin.net/ru" },
		slidersHead: [
			{path: "enlisted1.jpg", alt: "Советский солдат заходит со спины"},
			{path: "enlisted2.jpg", alt: "Советский солдат со спины атакует фашиста"},
			{path: "enlisted3.jpg", alt: "Советское оружие ППШ"},
			{path: "enlisted4.jpg", alt: "Фашист"},
			{path: "enlisted5.jpg", alt: "Оружие из игры лежит на столе"},
			{path: "enlisted6.jpg", alt: "Штурм укреплений врага"}
		],
		aboutTheGame: {
			title: "Размах имеет значение",
			text: "Enlisted – отрядный многопользовательский онлайн-шутер от первого лица, посвященный ключевым сражениям Второй мировой. В игре воссозданы атмосфера, оружие и военная техника той эпохи, а сражения масштабны: в одной битве участвуют множество солдат, танки и авиация при поддержке артиллерии и флота."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "enlistedBlock1.jpg",
					alt: "Снайпер на позиции",
					title: "Мы не привыкли относиться а лишь бы как",
					text: "Игра передает атмосферу реалистичности боя, мы внимательно относимся ко всем деталям того времени."
				},
				{
					path: "enlisted2.jpg",
					alt: "Демонстрационный стенд советских солдат и также представлены модельки фашистов",
					title: "Разноплановость",
					text: "Ты можешь ворваться в ряды противника на танке, переключиться на самолет в воздухе и прикрыть его, а уже в прорвавшемся окопе пробежаться солдатом и зачистить врага. Все это Enlisted!"
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7 / 8 / 10 64bit"},
				{title: "Процессор", value: "Intel Core i3 и лучше"},
				{title: "Оперативная память", value: "8 ГБ"},
				{title: "Видеокарта", value: "Nvidia GeForce 660 и выше, AMD Radeon серия 78XX и выше"},
				{title: "DirectX", value: "Версии 11 и выше"},
				{title: "Место на диске", value: "20 ГБ"},
			]
		}
	},
	{
		_id: "beholbeholbehol324234456vcb",
		added: "Admin",
		idMiddleParent: "6beholder3lfdg8776",
		poster: "beholderPoster.jpg",
		posterAlt: "Полицейские показываю, как надо скандировать во имя вождя",
		linkPublisher: "https://beholder-game.com/",
		messageForMenuActivity: `"Если Вы фанат серии игр Beholder, то определенно стоит играть, в остальном, мы бы не стали советовать". - Factory.inc`,
		releaseDate: "09 ноября 2016",
		developer: { name: "Warm Lamp Games", linkResourceDeveloper: "https://beholder.fandom.com/ru/wiki/Warm_Lamp_Games" },
		publisher: { name: "Alawar", linkResourcePublisher: "https://www.alawar.ru/" },
		slidersHead: [
			{path: "beholder3post1.jpg", alt: "Главный персонаж разговаривает с привратником"},
			{path: "beholder3post2.jpg", alt: "Полицейский офицер"},
			{path: "beholder3post3.jpg", alt: "Семья из игры стоит на фоне дома"},
			{path: "beholder3post4.jpg", alt: "Разговор с торговцем запрещенным)"}
		],
		aboutTheGame: {
			title: "Темная сторона твоей жизни",
			text: "В этом мрачном тоталитарном будущем жизни людей принадлежат Государству. Репрессивные законы и тотальная слежка пришли на смену свободе, равенству и братству. Отправить донос на главу семейства и разрушить семью? Или позволить ему исправиться, закрыв глаза на противозаконную деятельность? Или решиться на шантаж – возможно, единственный способ приобрести дорогие лекарства для больной дочери? А если следят и за вами? Вы познакомитесь с десятками жителей, узнаете об их проблемах и переживаниях, выясните все их тайны. И каждое принимаемое вами решение будет влиять на ход событий, приближая вас к одному из множества вариантов развязки."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "beholder3post1.jpg",
					alt: "Полицейский указывает на гражданина",
					title: "Мир совсем не приветливый",
					text: "Ты должен быть всегда начеку. Копы следят за тобой. Все очень опасно."
				},
				{
					path: "beholder3post2.jpg",
					alt: "Полицейские ведут людей на убой",
					title: "Подонок или герой",
					text: "Кем становиться в этой игре решать только тебе. Игра очень вариативна. Ты можешь пойти по головам людей или не потерять человеческий облик."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7"},
				{title: "Процессор", value: "Intel Core i5 or equivalent"},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GeForce GTX 960 or equivalent"},
				{title: "Место на диске", value: "4 GB"},
				{title: "Дополнительно1", value: "Требуются 64-разрядные процессор и операционная система"},
				{title: "Дополнительно2", value: "IMPORTANT REQUIREMENT: TO HAVE AN UNDENIABLE FAITH IN THE WISE LEADER!"}
			]
		}
	},
	{
		_id: "lostArkBigDatadfgdfgret",
		added: "Admin",
		idMiddleParent: "7lostArk8776",
		poster: "lostArkPoster.jpg",
		posterAlt: "Воин стоит перед каменным големом",
		linkPublisher: "https://la.mail.ru/",
		messageForMenuActivity: `"LOST ARK стремится освежить жанр MMORPG, вобрав в себя целый калейдоскоп различных механик, и интригует не на шутку.". - ИГРОМАНИЯ`,
		releaseDate: "27 октября 2019",
		developer: { name: "Smilegate RPG", linkResourceDeveloper: "https://www.smilegate.com/" },
		publisher: { name: "Smilegate RPG", linkResourcePublisher: "https://www.smilegate.com/" },
		slidersHead: [
			{path: "lostArkPoster1.jpg", alt: "Персонажи из игры Lost Ark"},
			{path: "lostArkPoster2.jpg", alt: "Девушка держит оружие"},
			{path: "lostArkposter3.jpg", alt: "Герой стоит перед храмом, который охвачен огнем"},
			{path: "lostArkPoster4.jpg", alt: "Интерфейс и боевка в игре"},
			{path: "lostArkposter5.jpg", alt: "Девушка в шляпе"},
			{path: "lostArkposter6.jpg", alt: "Девушка c пистолетом"},
			{path: "lostArkPoster7.jpg", alt: "Выбор персонажа и его стилизация"},
			{path: "lostArk8.jpg", alt: "Пещера данжа удивляет. Персонажи пробираются по данжу."},
			{path: "lostArkposter9.jpg", alt: "Монстр воставший из ада"},
			{path: "lostArkposter10.jpg", alt: "Команда героев готовится к штурму босса"},
			{path: "lostArk11.jpg", alt: "Герои игры Lost Ark"},
			{path: "lostArkPoster12.jpg", alt: "Герой из игры Lost Ark - девушка с рукой мутированной"}
		],
		aboutTheGame: {
			title: "Обзор игры",
			text: "Фэнтези MMORPG Lost Ark, разрабатываемая дочерней студией издателя Smilegate на движке Unreal Engine 3, впервые дебютировала на выставке G*Star 2014. Игрокам предстоит отправиться на поиски предмета под названием Ковчег, знания о котором давно утеряны. За Ковчегом охотится не только герой, но и темные силы, затевающие очередную войну. Что это за предмет и для чего он нужен, предстоит выяснить по ходу приключений."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "lostArkBlock1.jpg",
					alt: "герой сражается с драконом",
					title: "Боссы конечно топ",
					text: "Можно сколько угодно восхищаться боссами из Dark Souls, но в LostArk они сделаны тоже просто великолепно. Их многообразие будоражит всех игроков. Их величественность заставляет биться ваше сердце чаще."
				},
				{
					path: "lostArkBlock2.jpg",
					alt: "Команда проходит уровень",
					title: "Работа в команде",
					text: "Квесты проходить еще более увлекательно, если вы работаете в команде, а комьюнити в Lost Ark огромное"
				},
				{
					path: "lostArkposter3.jpeg",
					alt: "Корабль бороздит просторы воды",
					title: "И на суше и на море",
					text: "У Вас также есть возможность поуправлять кораблем в игре. Это интересно и очень увлекательно."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7 SP1 / Windows 8 / Windows 10 x64"},
				{title: "Процессор", value: "Intel Core i3 / AMD Ryzen 3 или лучше"},
				{title: "Оперативная память", value: "8ГБ ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GeForce GTX 460 или лучше"},
				{title: "Место на диске", value: "50ГБ"},
				{title: "DirectX", value: "DirectX 9.0с или выше"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"}
			]
		}
	},
	{
		_id: "remnantBigData45435654",
		added: "Admin",
		idMiddleParent: "21spark567r435emnant",
		poster: "remnantPoster.jpg",
		posterAlt: "Герой из игры сражается с монстрами",
		linkPublisher: "https://www.remnantgame.com/",
		messageForMenuActivity: `"Remnant: From the Ashes станет очень достойным приобретением, если вы уже прошли все части Dark Souls, The Surge, Bloodborne и даже доковыляли до конца Immortal: Unchained". - ИГРОМАНИЯ`,
		releaseDate: "16 августа 2019",
		developer: { name: "Gunfire Games", linkResourceDeveloper: "http://gunfiregames.com/" },
		publisher: { name: "Perfect World Entertainment", linkResourcePublisher: "https://sf.gearboxpublishing.com" },
		slidersHead: [
			{path: "remnantPoster1.jpg", alt: "Герой сражается с боссом"},
			{path: "remantPoster2.webp", alt: "Отстреливается из-за укрытия"},
			{path: "remnantPoster3.jpg", alt: "В храме перед стражей"},
			{path: "remnantPoster4.jpg", alt: "Героиня прячется за укрытием от монстра"}
		],
		aboutTheGame: {
			title: "Об игре Remnant: From the Ashes",
			text: "Игровой процесс Remnant: From the Ashes очень близок к играм серии Souls: управляемый игроком персонаж исследует мир, наполненный монстрами и трудными боссами; он точно так же может отдохнуть на «мировых камнях» — контрольных точках, аналогичных «кострам» из Souls. В отличие от серии Souls, где упор сделан на сражения в ближнем бою, Remnant включает в себя элементы шутера от третьего лица — игровой персонаж, помимо холодного оружия, носит с собой два вида огнестрельного: одно основное и одно дополнительное. В качестве такого оружия могут использоваться пулеметы, дробовики, охотничьи ружья, снайперские винтовки и тому подобное; к оружию можно присоединять «модификации», дающие игроку дополнительные возможности. В начале Remnant игрок создаёт собственного персонажа и в дальнейшем двигается через «миры» — области игры, каждая из которых генерируется случайным образом в каждом новом прохождении из собираемого так или иначе набора меньших фрагментов; иными словами, разные прохождения отличаются друг от друга, хотя эта последовательность и объединена общим для всех прохождений сюжетом. Игрок может улучшать оружие и броню за счёт найденных в мире игры материалов и также получать «очки талантов» для повышения характеристик своего игрового персонажа. В отличие от серии Souls, где все враги заранее расставлены разработчиками на определённых местах, в Remnant их появлением управляет ИИ-«режиссёр», наподобие схожей системы в Left 4 Dead: этот режиссёр может, например, бросить против игрока волну мелких врагов и одного или нескольких мини-боссов или, наоборот, дать передышку. Игра предупреждает игрока о появлении волны врагов специальным звуком."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "remnantBlock1.jpg",
					alt: "Монстр-крыса из игры",
					title: "Необычные монстры",
					text: "У нас нет надоедающих и приевшихся зомби и драконов, крушить черепа придется ненавистным крысам. ПОЛЧИЩАМ КРЫС!!!"
				},
				{
					path: "remnantBLock2.jpg",
					alt: "Главный герой целится из оружия в голову босса",
					title: "Уникальность боевки с боссами",
					text: "Под каждого главного-монстра нужен специальный подход, который нужно понять и выработать свою стратегию. Вариативность огромная."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 7 / 8 / 10 64 bit"},
				{title: "Процессор", value: "Intel Core i3-7350K (4.20 GHz) or better"},
				{title: "Оперативная память", value: "8 GB ОЗУ"},
				{title: "Видеокарта", value: "AMD Radeon RX 470"},
				{title: "DirectX", value: "Версии 11"}
			]
		}
	},
	{
		_id: "godofWar329454435bigdata",
		added: "Admin",
		idMiddleParent: "8godOfWar8776",
		poster: "godOfWarPoster.jpg",
		posterAlt: "Персонажи из игры God of War",
		linkPublisher: "https://www.playstation.com/ru-ru/god-of-war/",
		messageForMenuActivity: `"Революционного прорыва не было сделано. Разработчики боятся делать что-то новое. Если вы ожидаете чего-то большего, то огорчим, игра не стоит внимания, если вы поклонник этого мира, то однозначно рекомендуем.". - ИГРОМАНИЯ`,
		releaseDate: "14 января 2022",
		developer: { name: "Santa Monica Studio", linkResourceDeveloper: "https://sms.playstation.com/" },
		publisher: { name: "PlayStation PC LLC", linkResourcePublisher: "https://www.playstation.com/en-us/corporate/playstation-studios/" },
		slidersHead: [
			{path: "godPoster1.jpg", alt: "Кратос плывет на лодке с Атреем. Впереди из воды показывается голова огромного монстра."},
			{path: "godPost2.jpg", alt: "Кратос и Атрей сражаются с великаном"},
			{path: "godPost3.jpg", alt: "Кратос и Атрей победили варвара, отрубили ему голову"},
			{path: "god4.jpg", alt: "Кратос и Атрей сражаются с монстрами"},
			{path: "godPost5.jpg", alt: "Атрей сидит на спине у кратоса"},
			{path: "godPost6.jpg", alt: "Кратос кричит"},
			{path: "godPost7.jpg", alt: "Кратос обнимает Атрея"}
		],
		aboutTheGame: {
			title: "Ну теперь идеально.",
			text: "God of War – это одновременно и перезапуск, и продолжение знаменитой серии. Кратос перестал быть безумной машиной для убийств и старается поставить на праведный пусть собственное дитя. Игровой процесс стал менее динамичным, но больше полагается на тактические способности игрока и оценку ситуации, нежели безумную долбёжку кнопок. Открытый мир – эталон для некоторых игровых студий (учись, Ubisoft). Без проблем не обошлось, но об этом – далее."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "godPoster1.jpg",
					alt: "Кратос в ярости",
					title: "Эталонный подход к игровому дизайну",
					text: "Но помимо великолепного сюжета в игре присутствует не менее шедевральный игровой процесс. Бездумное закликивание врагов осталось в прошлом, теперь боевая система строится иначе. Основные элементы остались прежними: несколько видов вооружения, парирования, перекаты и режим ярости – всё на месте. Однако появились и новые механики. Один из них – рунические атаки. Каждое оружие Кратоса имеет две способности – слабую и сильную. Слабая полагается на расчистку арены и убийство совсем уж захудалых видов противников. Сильная ориентирована на нанесение большого урона или добивание толпы врагов. Количество урона и время восстановление рун завязаны на снаряжении Кратоса."
				},
				{
					path: "godPost2.jpg",
					alt: "Кратос и Атрей добрались до сокровища",
					title: "Скандинавская сказка для взрослых",
					text: "Путешествие Кратоса и Атрея – это одно из самых сильных высказываний в игровой индустрии. Проблема отцов и детей часто поднимается в эксклюзивах Sony, но именно директору проекта Кори Барлогу и студии Sony Santa Monica удалось сделать лучшее из них. Здесь затрагиваются натянутые отношения с неблизким родителем, потеря родного человека, осознание собственного божественного начала, а также путь к пониманию и примирению со своей судьбой."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows 10 64-bit"},
				{title: "Процессор", value: "Intel i5-6600k (4 core 3.5 GHz) or AMD Ryzen 5 2400 G (4 core 3.6 GHz)"},
				{title: "Оперативная память", value: "8 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA GTX 1060 (6 GB) or AMD RX 570 (4 GB)"},
				{title: "DirectX", value: "Версии 11"},
				{title: "Сеть", value: "Широкополосное подключение к интернету"},
				{title: "Место на диске", value: "70 GB"},
				{title: "Дополнительно", value: "DirectX feature level 11_1 required"}
			]
		}
	},
	{
		_id: "dlshBigData05469546cvb",
		added: "Admin",
		idMiddleParent: "9dlsh84545",
		poster: "dlsh2Poster.jpg",
		posterAlt: "Главный герой стоит на памятнике архитектуры",
		linkPublisher: "https://dl2.dyinglightgame.com/ru/",
		messageForMenuActivity: `"Мы ждали крепкий экшен с паркуром и зомби, мы его получили. Формула знакома и по-прежнему цепляет: паркур, разруха и постапокалипсис. Там, где Techland попыталась добавить обороты или подглядеть идеи конкурентов, вышло спорно. Там, где разработчики оставили всё как есть, вышло отлично.". - ИГРОМАНИЯ`,
		releaseDate: "07 декабря 2021",
		developer: { name: "Techland", linkResourceDeveloper: "https://techland.net/" },
		publisher: { name: "Techland", linkResourcePublisher: "https://techland.net/" },
		slidersHead: [
			{path: "dlsh2cvbnbvn657567.jpg", alt: "Убитый человек лежит в крови на полу"},
			{path: "dlsh2poster2.jpg", alt: "Главный герой выпивает в баре"},
			{path: "dlsh2Poster3.jpg", alt: "Главный герой сражается с бандитами"}
		],
		aboutTheGame: {
			title: "Миру мир, а Dying Light 2 Stay Human зомби и мерзкие твари",
			text: "Когда мир пал перед харранским вирусом, человечество нашло приют в нескольких последних уцелевших поселениях. Связью между анклавами служат Пилигримы — люди, которые отваживаются путешествовать по жестокому пост-апокалиптическому миру. Они приносят ресурсы и ценную информацию. Вы один из них, и вы попадаете в Город. Место, где человечество может вновь обрести надежду."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "dlsh2Poster1.jpg",
					alt: "Главный герой паркурит по элементам городского пространства",
					title: "Паркур на свежем воздухе от зомби)",
					text: "Паркур не такая уж и избитая тема как может показаться, а наша механика его исполнения ну просто шик и блеск"
				},
				{
					path: "dlstHum2poster.jpg",
					alt: "Зомби бросается на главного героя",
					title: "Бывает очень жутко",
					text: "Мы бы хотели оказаться с Вами в комнате, когда вы будете пробираться по катакомбам или заброшенным пентхаусам ночью. Порой можно нарваться на неожиданную встречу) Визжать вы будете очень сильно."
				},
				{
					path: "dlsh3.jpg",
					alt: "Укрепление людей прям на архитектурном сооружении",
					title: "Дизайн объектов",
					text: "Иногда Вам будет хотеться просто попаркурить по городу и понаблюдать за различными сооружениями постапокалипсиса"
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "Windows® 7"},
				{title: "Процессор", value: "Intel Core i3-9100 / AMD Ryzen 3 2300X"},
				{title: "Оперативная память", value: "8 GB ОЗУ"},
				{title: "Видеокарта", value: "NVIDIA® GeForce® GTX 1050 Ti / AMD Radeon™ RX 560 (4GB VRAM)"},
				{title: "Место на диске", value: "60 GB"}
			]
		}
	},
	{
		_id: "gta5BigData3454355vbbnvbn",
		added: "Admin",
		idMiddleParent: "10gta5jkjh84545",
		poster: "gta5Poster.jpg",
		posterAlt: "Майкл, Тревор Франклин, персонажи из игры",
		linkPublisher: "https://www.rockstargames.com/ru/",
		messageForMenuActivity: `"Трое в тачке не считая собаки. GTA 5 в своей серии просто доминирует как всегда". - ИГРОМАНИЯ`,
		releaseDate: "17 сентября 2013",
		developer: { name: "Rockstar North", linkResourceDeveloper: "https://www.rockstargames.com/ru" },
		publisher: { name: "Rockstar Games", linkResourcePublisher: "https://www.rockstargames.com/ru" },
		slidersHead: [
			{path: "gta5Poster1.jpg", alt: "GTA 5 Постер"},
			{path: "gta5poster2.jpg", alt: "На вертолете над городом"},
			{path: "gta5Poster3.jpg", alt: "Постер игры GTA 5. Изображены на нем главные герои."},
			{path: "gta5poster4.jpg", alt: "Ограбление в магазине"},
			{path: "gta5poster5.jpg", alt: "GTA 5 ретро"},
			{path: "gta5Poster6.jpg", alt: "Главный герой замахивается битой в сторону мима"}
		],
		aboutTheGame: {
			title: "GTA 5 как много в этих буквах",
			text: "Действие четвертой и пятой GTA, как известно, происходит в новой реальности, где не было ни Клода, ни Томми Версетти, ни Си-Джея. Вышло почти как с перезапуском Star Trek от Джей-Джей Абрамса или перезагрузками комиксовых серий: названия те же, места те же, но всё — другое. Поэтому возвращение в Лос-Сантос несколько опустошает. Переделанный для нового поколения город сохранил кое-какие внешние черты, но в целом стал совершенно незнакомым. Например, от старой Гроув-стрит, где по сюжету San Andreas жили Карл Джонсон и его банда, остался только затхлый дворик, а его прежних обитателей будто никогда и не существовало. Ныне здесь живут фиолетовые «Баллас», и, если умудриться явиться сюда пешком, ребята грабанут вас всем районом. Целую эпоху из истории Сан-Андреаса просто стерли, а сам штат перестроили заново. Из трех городов остался один Лос-Сантос, но он настолько преобразился и разросся, что стал-таки похож на настоящий город."
		},
		atmosphere: {
			title: "Полный треш",
			blocks: [
				{
					path: "gta5Block1.jpg",
					alt: "Герои высаживаются на крышу здания",
					title: "День расплаты",
					text: "Многие сюжетные задания в GTA V — совместные для всех трех героев, и тут новомодная геймплейная фишка с переключением персонажей уже работает не совсем так, как хотелось бы. Да, зачастую вы можете выбрать — управлять ли вертолетом в роли Тревора, десантироваться ли Майклом или прикрывать напарников Франклином, но на самом деле выбора нет: миссии строго следуют сценарию, лишь бы эффектно было."
				},
				{
					path: "gta5Block2.jpg",
					alt: "Ограбление",
					title: "Туда, где я не был",
					text: "Мало какая игра обходится с дополнительным контентом так, как GTA V. Rockstar, прекрасно понимая, что многие игроки не заметят и половины побочных занятий, секретов и симпатичных мелочей, построили настоящий рай для исследователей. О том, что в игре есть акваланги, вам напомнят в единственной сюжетной миссии, и вы можете этот момент запросто упустить. Но если не упустите — откроете целый подводный мир со своими секретами, ценной добычей и кусачими акулами."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "не ниже Windows 7/8/10 "},
				{title: "Процессор", value: " Intel core 2 Quad 2.4 GHz "},
				{title: "Оперативная память", value: "4 GB ОЗУ"},
				{title: "Видеокарта", value: " Nvidia GeForce GTX 9800 GT 1GB "}
			]
		}
	},
	{
		_id: "theWitcherBigData3435345",
		added: "Admin",
		idMiddleParent: "11theWither5jkjh84545",
		poster: "theWitcherPoster.jpg",
		posterAlt: "Постер игры: Голова волка и в ней сражается ведьмак с грифоном",
		linkPublisher: "https://www.thewitcher.com/ru/witcher1",
		messageForMenuActivity: `"Любовь на острие меча". - ИГРОМАНИЯ`,
		releaseDate: "26 октября 2007",
		developer: { name: "CD Projekt Red", linkResourceDeveloper: "https://www.cdprojekt.com/en/" },
		publisher: { name: "CD Projekt", linkResourcePublisher: "https://www.cdprojekt.com/en/" },
		slidersHead: [
			{path: "twPoster1.jpg", alt: "Ведьмак стоит в городе"},
			{path: "twPoster2.jpg", alt: "Ведьмак высадился на остров"},
			{path: "twPoster3.jpg", alt: "Ведьмак сражается с драконом"},
			{path: "twPoster4.jpg", alt: "Трисс Меригольд"},
			{path: "twPoster5.jpg", alt: "Цири сидит с мастером Ведьмака у костра"},
			{path: "twPoster6.jpg", alt: "Ведьмак сражается с бандитами"},
			{path: "twPoster7.jpg", alt: "Цири"},
			{path: "twPoster8.jpg", alt: "Цири с Ведьмаком"},
			{path: "twPoster9.jpg", alt: "Ведьмак в очках"},
			{path: "twPoster10.jpg", alt: "Персонаж из мира Ведьмака"},
			{path: "twPoster11.jpg", alt: "Ведьмак смотрит на Kaer Morhen"}
		],
		aboutTheGame: {
			title: "Об игре The Witcher",
			text: "Амбициозная ролевая игра по мотивам творчества польского писателя Анджея Сапковского. Самобытный мир, созданный его фантазией, отличается тем, что здесь нет ни одного положительного героя — наместники продажны, принцессы блудливы, а рыцари жестоки. Все решения игрока и его репутация формируют сюжетную линию с тремя возможными концовками. Главный герой — Геральт, ведьмак из Ривии, профессиональный истребитель чудовищ. В его арсенале — обычное и серебряное оружие, наркотики и эликсиры, смертельные для неподготовленного человека, колдовские «знаки», способные управлять другими существами. Шесть боевых стилей, десятки различных зелий, изменяемое оружие и магия — выбор богатый. Особое удовольствие получат любители динамичного боя и зрелищных способов уничтожения противника (к примеру, здесь можно художественно обезглавить врага, перерезать ему горло и т. д.). Для того чтобы сражения выглядели реалистично, в работе над анимацией принимали участие специально приглашенные мастера восточных единоборств и специалисты боя на мечах."
		},
		atmosphere: {
			title: "Атмосфера",
			blocks: [
				{
					path: "twBlock1.jpg",
					alt: "Ведьмак внутри монстра",
					title: "Кровожадные монстры",
					text: "Страшные твари поджидают тебя на каждом шагу. Поэтому всега будь осторожен. Держи свой клинок поблизости."
				},
				{
					path: "twBLock2.jpg",
					alt: "Девушка из мира Ведьмак",
					title: "Главная награда",
					text: "Девушки всегда были главной усладой Ведьмака. Поэтому по сюжету игры с ними вы будете контактировать часто, в зависимости от ваших диалогов с ними, у вас будут либо друзья, либо враги."
				},
				{
					path: "twBlock3.jpg",
					alt: "Ведьмак на коне в заснеженной природе",
					title: "Природа впечатляет",
					text: "Над окружающей действительностью разработчики поработали на славу. Величественные горы, огромные вековые дубы, стройные сосны: все это заставит Ваш зрачок расшириться."
				},
				{
					path: "twBlock4.jpg",
					alt: "Ведьмак сражается с бандитами",
					title: "От любви до ненависти",
					text: "Будьте готовы к тому, что не все в городе Вас любят. Помогая одним, Вы портите отношения с другими. Все как в жизни, а это значит, что нужно частенько укрощать неродивых."
				},
				{
					path: "twBlock5.jpg",
					alt: "Игра в гвинт за столом",
					title: "Игра в игре",
					text: "Гвинт - это популярная игра во всех злачных местах мира Ведьмак."
				}
			]
		},
		systemRequirements: {
			Windows: [
				{title: "OC", value: "64-bit Windows 7, 64-bit Windows 8 (8.1) или 64-bit Windows"},
				{title: "DirectX", value: "DirectX 11 является необходимым для данной игры"},
				{title: "Процессор", value: "Intel CPU Core i5-2500K 3.3GHz / AMD CPU Phenom II X4 940"},
				{title: "Оперативная память", value: "6 GB ОЗУ"},
				{title: "Видеокарта", value: "Nvidia GPU GeForce GTX 660 / AMD GPU Radeon HD 7870"},
				{title: "Место на диске", value: "40 GB"}
			]
		}
	},
]

function getBigDataGameById(id) {
	return new Promise((resolve, reject) => {
		const findEl = arrayBigDataGames.find(item => item.idMiddleParent === id)
		setTimeout(() => {
			resolve(findEl)
		}, 1000)
	})
}

export default getBigDataGameById
