[
	{"title": "Развлечение превыше всего", "text": "Отдых важен для каждого человека, и мы стараемся наполнить его самыми яркими красками. Нам важно, чтобы вы получали удовольствие.", "pathImage": "woman-pistols.jpg", "alt": "Девушка с пистолетами"},
	{"title": "Только качество", "text": "Проработка даже самых мелких нюансов, вот что движет нами. Мы вдумчиво добавляем новые фичи и руководствуемся таким понятием как - 7 раз отмерь, один раз отреж. Постоянно модернизируя старое и добавляя новое - мы пытаемся довести ваше взаимодейтсвие с Factory до идеала. Чтобы вам было комфортно, и вам нравилось находиться здесь. Мы добиваемся того, чтобы вы общались и договаривались о совместной игре здесь, а не шли на сторонние ресурсы.", "pathImage": "orkSekir.jpg", "alt": "Орк из орды"},
	{"title": "Порядочность, приветливость, экологичность", "text": "Мы боремся с конфликтами в наших чатах. Считаем, что распрей и негатива между людьми не должно быть. Ведь все мы тут только за тем, чтобы оставить свою рецензию на продукт или поиграть. Поэтому мы тщательно смотрим за тем, что пишут наши пользователи. Мы хотим быть для вас домом, а не местом разжигания ненависти.", "pathImage": "community-kibersport.jpeg", "alt": "Ребята играют в видеоигры"},
	{"title": "Events", "text": "Каждый год мы стараемся порадовать вас очередным событием, ведь живое общение также важно, как и виртуальное. Мы организуем выставки, конференции, турниры. Делаем это с душой и любовью.", "pathImage": "igromir.jpg", "alt": "Две девушки стоят на игромире в образах героев игр."},
	{"title": "Важен каждый человек", "text": "Мы боремся за каждого пользователя, так как люди пишут классные рецензии на игры и проставляют рейтинги. Чем больше у нас людей, тем более качественные оценки имеют игры. Это очень важно для нас.", "pathImage": "massEffect.jpg", "alt": "Персонажи из игры MassEffect в кафе."},
	{"title": "Мы мыслим в мировом масштабе", "text": "Нашей платформой пользуются люди со всего света. Мы ценим такое культурное многообразие, уважаем каждую индивидуальность. Мы продолжаем расширяться и не останавливаемся на достигнутом.", "pathImage": "robotAndHuman.jpg", "alt": "Человек и робот в космосе."},
	{"title": "Охваты - это всегда ответственность", "text": "Наша площадка оказывает колоссальное влияние на игровую индустрию, потому что наши пользователи формируют рецензии и рейтинги. Поэтому стремимся подходить ответственно к этическому выбору. Мы всегда учитываем мнения людей и разрботчиков.", "pathImage": "lol.jpg", "alt": "Персонаж из игры LOL бросает бомбу."},
	{"title": "Поддерживаем Российских разработчиков игр", "text": "О своей игре может заявить каждый, но так как в первую очередь мы русскоязычная платформа, то мы удиляем огромное внимание отечественным проивзодителям игр. Порой ребятам очень сложно рассказать о своем продукте, если у них нет многомилионного канала в YouTube. Так как у нас есть охваты. Мы помогаем им заявлять о себе. Мы хотим поднять отечественную индустрию игр на новый уровень.", "pathImage": "metro.jpg", "alt": "Артем смотрит из тонеля на небо.", "icon": "star.svg", "altIcon": "Желтая звезда"},
	{"title": "Тихая гавань", "text": "Абсолютно не важно, какая у Вас политическая ситуация в стране и где вы находитесь. Доступ к контенту и играм, которые представлены у нас в магазине, всегда будет Вам открыт. Это самый основной наш принцип. Мы не про политику, мы про игры, развлечения и мир на Земле.", "pathImage": "harbor.jpg", "alt": "Тихая ночная гавань", "icon": "peace.svg", "altIcon": "Земля с сердечком"}
]