{
	"titlesReg":[
		{"_id": "345645gfh", "title": "Ну что ж, давайте начинать"},
		{"_id": "bvn6785", "title": "Как Вас зовут?"},
		{"_id": "0000vcbvcb", "title": "Идентификация"},
		{"_id": "99834535", "title": "Соглашения"},
		{"_id": "45645687", "title": "Ваш SECRET KEY"},
		{"_id": "023134", "title": "Последний шаг"},
		{"_id": "0324245646765", "title": "Напутствие мастера!"}
	],
	"messagesReg": [
		{"_id": "56465", "value": "Мы проверяем некоторую информацию о вас, чтобы ваше пребывание здесь было максимально комфортным."},
		{"_id": "1212123", "value": "Ваше настоящее имя может использоваться, когда вы обращаетесь, например в службу поддержки или оплачиваете продукцию Factory.inc. В таких ситуация мы используем деловую форму взаимодейтсвия. Заверяем Вас о том, что по умолчанию оно не отображается для других пользователей."},
		{"_id": "909090", "value": "Почта будет использоваться для авторизации"},
		{"_id": "7546435", "value": "Ознакомьтесь с условиями использования нашей платформы и пройдите captcha"},
		{"_id": "1213000005765", "value": "Создайте надежный пароль, чтобы обезопасить свою учетную запись"},
		{"_id": "99991231324", "value": "Придумайте логин и никнейм. Логин используется для авторизации, под никнеймом вы будете взаимодействовать с нашими воинами альянса) Да, да вы правильно поняли, никнейм видят все."}
	],
	"modalRegConfig": {
		"2": {
			"text": "Зачем указывать телефон?",
			"modalText": "Номер телефона позволит нам повысить безопасность вашей учетной записи, а также вы сможете получать крутые анонсы"
		},
		"3": {
			"text": "Почему это важно?",
			"modalText": "В первую очередь нам очень важно соблюдение Ваших прав, поэтому мы подходим строго к политике. Также для продуктивной и безопасной работы, нам требуется получить ваше согласие."
		},
		"4": {
			"text": "Помощь по созданию пароля",
			"modalText": "Пароль должен содержать: от 8 и более знаков; специальный символ (хотя бы один) - !@#$%&^*?; цифру (хотя бы одну); одну букву или более в верхнем регистре (буква должна быть на латинице). Также рекомендуем добавить совершенно необычную фразу, например /краснаяшапочкасильнееалисы/."
		},
		"5": {
			"text": "Оригинальный никнейм",
			"modalText": "Очень многое зависет от вашего ника, мы привыкли встречать по нику, а провожать по количеству пройденных игр, и тем не менее он должен быть уникальным, так как поиск и добавление в друзья будет осуществляться по нему. По никнейму можно понять кто вы, и что Вас интересует. Вообщем - это важно)"
		}
	}
}